const sections = [
    {
        id: 1,
        title: 'Початок роботи',
        content:
            'З самого початку React був спроєктований так, щоб його можна було впроваджувати поступово. Тобто ви можете додавати так мало або так багато React-у, як вам потрібно. Скористайтеся інформацією та посиланнями цього розділу, якщо просто бажаєте відчути React на смак або додаєте трохи "інтерактивності" до простої HTML-сторінки, чи, навіть, якщо стартуєте складний React-проєкт'
    },
    {
        id: 2,
        title: 'Перенаправлення рефів',
        content:
            'Перенаправлення рефів — це техніка для автоматичної передачі рефа від компонента до одного із його дітей. Для більшості компонентів, зазвичай, вона не є необхідною. Тим не менше, може бути корисною в деяких випадках, особливо якщо ви пишете бібліотеку. Давайте розглянемо найбільш поширені сценарії.'
    },
    {
        id: 3,
        title: 'Фрагменти',
        content:
            'Повернення кількох елементів з компонента є поширеною практикою в React. Фрагменти дозволяють формувати список дочірніх елементів, не створюючи зайвих вузлів в DOM.'
    }
];

export default function Main() {
    return (
        <main className="main">
            {sections.map(section => (
                <section key={section.id}>
                    <h2>{section.title}</h2>
                    <p>{section.content}</p>
                </section>
            ))}
        </main>
    );
}
